#фукција која проверава да ли је број прост
def prost(x):
	#на почетку претпоставимо да је бој прост
	prost = True
	
	for i in range(2,x):
		#проверавамо да ли постоји неки делилац нашег броја
		if(x % i == 0):
			#ако делилац постоји онда број није прост
			prost = False
			break
	return prost
# у променљивој zbir чувамо број кућа у улици са простим бројем
zbir = 0
n = int(input())

for i in range(2,n+1):
	#проверавамо да ли је редни број куће прост
	if(prost(i)):
		#ако је редни број куће прост поштар треба са обиђе ту кућу
		zbir += 1

print (zbir)